Revit 2027 API
SolidOptions Constructor
 Creates a new SolidOptions class with material and graphics style settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidOptions(
	ElementId materialId,
	ElementId graphicsStyleId
)
Public Sub New (
	materialId As ElementId,
	graphicsStyleId As ElementId
)
public:
SolidOptions(
	ElementId^ materialId,
	ElementId^ graphicsStyleId
)
new :
        materialId : ElementId *
        graphicsStyleId : ElementId -> SolidOptions
Parameters
materialId ElementId
 The material id for the Solid.
graphicsStyleId ElementId
 The graphics style id for the Solid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SolidOptions Class
Autodesk.Revit.DB Namespace